; domain
(define (domain housework)

    (:requirements :strips :typing :adl)

    ; Begin types
    (:types
        agent room item - object
        surface appliance container - item ; Surfaces, appliances, and containers are special types of items
    )
    ; End types

    ; Begin predicates
    (:predicates
        (agent_at ?a - agent ?r - room)
        (agent_hand_free ?a - agent)
        (agent_has_item ?a - agent ?i - item)

        (item_at ?i - item ?r - room)
        (item_on ?i - item ?s - surface)
        (item_in ?i1 - item ?i2 - appliance) ; Represents an item being inside an appliance
        (item_in_container ?i1 - item ?i2 - container) ; Represents an item being inside a container

        (item_accessible ?i - item)
        (item_pickable ?i - item)

        (neighbor ?r1 - room ?r2 - room)
        (appliance_on ?app - appliance)

        ; Task-specific states
        (heated ?i - item)

        ; Item type identification
        (is_food ?i - item)
        (is_microwave ?i - appliance)
        (is_water_bottle ?i - item)
        (is_desk ?s - surface)
        (is_egg ?i - item)
        (is_egg_container ?c - container)
    )
    ; End predicates

    ; Begin actions
    (:action goto
        :parameters (?a - agent ?from - room ?to - room)
        :precondition (and (agent_at ?a ?from) (neighbor ?from ?to))
        :effect (and (not (agent_at ?a ?from)) (agent_at ?a ?to))
    )

    (:action pick_from_room
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?i ?r) (item_accessible ?i) (item_pickable ?i) (agent_hand_free ?a))
        :effect (and (not (item_at ?i ?r)) (not (agent_hand_free ?a)) (agent_has_item ?a ?i))
    )

    (:action pick_from_appliance
        :parameters (?a - agent ?i - item ?app - appliance ?r - room)
        :precondition (and (agent_at ?a ?r) (item_in ?i ?app) (appliance_on ?app) (agent_hand_free ?a))
        :effect (and (not (item_in ?i ?app)) (not (agent_hand_free ?a)) (agent_has_item ?a ?i))
    )

    (:action place_on_surface
        :parameters (?a - agent ?i - item ?s - surface ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?s ?r) (agent_has_item ?a ?i))
        :effect (and (not (agent_has_item ?a ?i)) (agent_hand_free ?a) (item_on ?i ?s))
    )
    
    (:action place_in_appliance
        :parameters (?a - agent ?i - item ?app - appliance ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?app ?r) (agent_has_item ?a ?i))
        :effect (and (not (agent_has_item ?a ?i)) (agent_hand_free ?a) (item_in ?i ?app))
    )

    (:action turnon
        :parameters (?a - agent ?app - appliance ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?app ?r) (not (appliance_on ?app)))
        :effect (appliance_on ?app)
    )

    (:action turnoff
        :parameters (?a - agent ?app - appliance ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?app ?r) (appliance_on ?app))
        :effect (not (appliance_on ?app))
    )

    (:action heat_food
        :parameters (?a - agent ?f - item ?m - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r) (item_at ?m ?r) (is_microwave ?m)
            (item_in ?f ?m)
            (appliance_on ?m)
            (not (heated ?f))
        )
        :effect (heated ?f)
    )

    (:action store_in_container
        :parameters (?a - agent ?i - item ?c - container ?r - room)
        :precondition (and (agent_at ?a ?r) (item_at ?c ?r) (agent_has_item ?a ?i))
        :effect (and (not (agent_has_item ?a ?i)) (agent_hand_free ?a) (item_in_container ?i ?c))
    )
    ; End actions
)

; problem
(define (problem home_housework)
    (:domain housework)

    ; Begin objects
    (:objects
        robot - agent
        kitchen livingroom bathroom bedroom - room
        food water_bottle eggs - item
        microwave - appliance
        desk - surface
        egg_container - container
    )

    ; Begin init
    (:init
        ; Connections
        (neighbor kitchen livingroom)
        (neighbor livingroom kitchen)
        (neighbor kitchen bathroom)
        (neighbor bathroom kitchen)
        (neighbor kitchen bedroom)
        (neighbor bedroom kitchen)
        (neighbor livingroom bathroom)
        (neighbor bathroom livingroom)
        (neighbor livingroom bedroom)
        (neighbor bedroom livingroom)
        (neighbor bathroom bedroom)
        (neighbor bedroom bathroom)

        ; Positions
        (agent_at robot livingroom)
        (agent_hand_free robot)
        (item_at food kitchen)
        (item_at microwave kitchen)
        (item_at water_bottle kitchen)
        (item_at eggs kitchen)
        (item_at egg_container kitchen)
        (item_at desk livingroom)

        ; Attributes
        (item_accessible food)
        (item_pickable food)
        (item_accessible microwave)
        (item_accessible water_bottle)
        (item_pickable water_bottle)
        (item_accessible eggs)
        (item_pickable eggs)
        (item_accessible egg_container)
        (item_accessible desk)

        (is_food food)
        (is_microwave microwave)
        (is_water_bottle water_bottle)
        (is_desk desk)
        (is_egg eggs)
        (is_egg_container egg_container)

        (not (heated food))
        (not (appliance_on microwave))
    )
    ; End init

    ; Begin goal
    (:goal (and
        (heated food)
        (item_on food desk)
        (item_on water_bottle desk)
        (item_in_container eggs egg_container)
    ))
    ; End goal
)

; plan
1. (goto robot livingroom kitchen)
   deleted: (agent_at robot livingroom)
   added: (agent_at robot kitchen)
   goals met: 0 of 4
2. (pick_from_room robot food kitchen)
   deleted: (item_at food kitchen) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 0 of 4
3. (place_in_appliance robot food microwave kitchen)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_in food microwave)
   goals met: 0 of 4
4. (pick_from_room robot eggs kitchen)
   deleted: (item_at eggs kitchen) (agent_hand_free robot)
   added: (agent_has_item robot eggs)
   goals met: 0 of 4
5. (turnon robot microwave kitchen)
   added: (appliance_on microwave)
   goals met: 0 of 4
6. (heat_food robot food microwave kitchen)
   added: (heated food)
   goals met: 1 of 4
7. (store_in_container robot eggs egg_container kitchen)
   deleted: (agent_has_item robot eggs)
   added: (agent_hand_free robot) (item_in_container eggs egg_container)
   goals met: 2 of 4
8. (pick_from_room robot water_bottle kitchen)
   deleted: (item_at water_bottle kitchen) (agent_hand_free robot)
   added: (agent_has_item robot water_bottle)
   goals met: 2 of 4
9. (goto robot kitchen livingroom)
   deleted: (agent_at robot kitchen)
   added: (agent_at robot livingroom)
   goals met: 2 of 4
10. (place_on_surface robot water_bottle desk livingroom)
   deleted: (agent_has_item robot water_bottle)
   added: (agent_hand_free robot) (item_on water_bottle desk)
   goals met: 3 of 4
11. (pick_from_appliance robot food microwave livingroom)
   deleted: (item_in food microwave) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 3 of 4
12. (place_on_surface robot food desk livingroom)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_on food desk)
   goals met: 4 of 4
